package utils

func GetCharValue(char string) int {
	mapping := map[string]int{
		"ก": 1, "ด": 1, "ถ": 1, "ท": 1, "ภ": 1, "ฤ": 1, "ฦ": 1, "า": 1, "ำ": 1, "ุ": 1, "่": 1,
		"ข": 2, "ง": 2, "ช": 2, "บ": 2, "ป": 2, "เ": 2, "แ": 2, "ู": 2, "้": 2,
		"ฆ": 3, "ต": 3, "ฑ": 3, "ฒ": 3, "๋": 3,
		"ค": 4, "ธ": 4, "ญ": 4, "ร": 4, "ษ": 4, "ะ": 4, "โ": 4, "ั": 4, "ิ": 4,
		"ฉ": 5, "ฌ": 5, "ณ": 5, "น": 5, "ม": 5, "ห": 5, "ฎ": 5, "ฮ": 5, "ฬ": 5, "ึ": 5,
		"จ": 6, "ล": 6, "ว": 6, "อ": 6, "ใ": 6,
		"ซ": 7, "ศ": 7, "ส": 7, "๊": 7, "ี": 7, "ื": 7,
		"ผ": 8, "ฝ": 8, "พ": 8, "ฟ": 8, "ย": 8, "็": 8,
		"ฏ": 9, "ฐ": 9, "ไ": 9, "์": 9,
		"a": 1, "i": 1, "j": 1, "q": 1, "y": 1, "A": 1, "I": 1, "J": 1, "Q": 1, "Y": 1,
		"b": 2, "k": 2, "r": 2, "B": 2, "K": 2, "R": 2,
		"c": 3, "g": 3, "l": 3, "s": 3, "C": 3, "G": 3, "L": 3, "S": 3,
		"d": 4, "m": 4, "t": 4, "D": 4, "M": 4, "T": 4,
		"e": 5, "h": 5, "n": 5, "x": 5, "E": 5, "H": 5, "N": 5, "X": 5,
		"u": 6, "v": 6, "w": 6, "U": 6, "V": 6, "W": 6,
		"o": 7, "z": 7, "O": 7, "Z": 7,
		"f": 8, "p": 8, "F": 8, "P": 8,
	}
	if val, ok := mapping[char]; ok {
		return val
	}
	return 0
}

func AnalyzeName(name string) int {
	sum := 0
	runes := []rune(name)
	for _, r := range runes {
		sum += GetCharValue(string(r))
	}
	return sum
}
